updated the README file
